posts/elisp.org
#+TITLE: Elisp
#+SETUPFILE: https://blog.bugswriter.com/static/theme.setup

#+BEGIN_SRC emacs-lisp :results output
(file-name-extension "tring.org")
#+END_SRC

#+RESULTS:

* Basics

true ===> t, 0, "", []
false ===> nil, (), (empty), '()
and , or
/= not equal


string comaprision
(string-equal "abc" "abc")
(not (string-equal "abc" "abc")))


** (setq a 3 b 4 c 5)

(let (a,b)
(setq a 3)
(setq b 4)
(+ a b)
) ; last statemet return of local variable
** if
(if (< 3 2) 5 6) ;  6
** when
(when test expr1 expr2 …)
(if test progn ( exp1 exp2))
progn return last state ment in his body ( progn = {} )
** Loop
 (setq x 0)

(while (< x 4)
  (print (format "number is %d" x))
  (setq x (1+ x)))
* Basics
** Elisp Basics
**** printing
#+BEGIN_SRC emacs-lisp
; printing
(message "hi")

; printing variable values
(message "Her age is: %d" 16)        ; %d is for number
(message "Her name is: %s" "Vicky")  ; %s is for string
(message "My list is: %S" (list 8 2 3))  ; %S is for any lisp expression
#+END_SRC
**** Convert Float/Integer
#+BEGIN_SRC emacs-lisp
;; int to float
(float 3) ; 3.0

(truncate 3.3) ; 3

(floor 3.3) ; 3

(ceiling 3.3) ; 4

(round 3.4) ; 3

#+END_SRC
**** True/False
#+BEGIN_SRC emacs-lisp
;; all the following are false. They all evaluate to nil
(if nil "yes" "no") ;  "no"
(if () "yes" "no") ;  "no"
(if '() "yes" "no") ;  "no"
(if (list) "yes" "no") ;  "no", because (list) eval to a empty list, same as ()




(if t "yes" "no") ;  "yes"
(if 0 "yes" "no") ;  "yes"
(if "" "yes" "no") ;  "yes"
(if [] "yes" "no") ;  "yes". The [] is vector of 0 elements
#+END_SRC
