posts/elisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-21 Wed 23:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elisp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="AkashRaj" />
<link rel="stylesheet" type="text/css" href="https://blog.bugswriter.com/static/style.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Elisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5786feb">1. Basics</a>
<ul>
<li><a href="#org52a75ad">1.1. (setq a 3 b 4 c 5)</a></li>
<li><a href="#orgd36cfd5">1.2. if</a></li>
<li><a href="#org7d0c738">1.3. when</a></li>
<li><a href="#orgcc89c53">1.4. Loop</a></li>
</ul>
</li>
<li><a href="#orgb80c6ac">2. Basics</a>
<ul>
<li><a href="#org8cb32c8">2.1. Elisp Basics</a></li>
<li><a href="#org12b5732">2.2. ELisp Text-Processing overview</a>
<ul>
<li><a href="#orgf968653">2.2.1. Cursor Position</a></li>
<li><a href="#orgdd6e3fc">2.2.2. Move Cursor, Search Text</a></li>
<li><a href="#orgc8c5be9">2.2.3. Delete, insert, change, Text</a></li>
<li><a href="#orgcd7db4d">2.2.4. String</a></li>
<li><a href="#orgece3e88">2.2.5. Buffer</a></li>
<li><a href="#org88114dc">2.2.6. File</a></li>
<li><a href="#orgf3bcd0e">2.2.7. Simple Example</a></li>
</ul>
</li>
<li><a href="#org3899158">2.3. Elisp Examples</a>
<ul>
<li><a href="#org5b958e5">2.3.1. Insert Text</a></li>
<li><a href="#org47ae068">2.3.2. insert around region</a></li>
<li><a href="#org0798fd7">2.3.3. Select current Word</a></li>
<li><a href="#orgb8132d0">2.3.4. Select Current Line</a></li>
<li><a href="#org4376694">2.3.5. Find Replace String in Region</a></li>
<li><a href="#org9deaf70">2.3.6. delete enclosed text</a></li>
</ul>
</li>
<li><a href="#orgb682ed3">2.4. Delete Linebreaks</a>
<ul>
<li><a href="#org7f96d00">2.4.1. Random Number</a></li>
<li><a href="#org5873abe">2.4.2. Reference LookUP</a></li>
<li><a href="#orgd745e30">2.4.3. Change Newline Character</a></li>
<li><a href="#org47b0ffc">2.4.4. Delete Currente File</a></li>
<li><a href="#orgc967d6e">2.4.5. Insert Vertical Column of Numbers</a></li>
</ul>
</li>
<li><a href="#org215d392">2.5. Evaluate Elisp Code</a></li>
<li><a href="#org7b75aa8">2.6. Doc lookUp</a>
<ul>
<li><a href="#org8eddb24">2.6.1. LookUp Function Doc String</a></li>
</ul>
</li>
<li><a href="#org82b69cc">2.7. Search Doc</a></li>
</ul>
</li>
<li><a href="#org65b9a74">3. Basic Funtions</a>
<ul>
<li><a href="#orge317739">3.1. Get Cursor Position</a></li>
<li><a href="#org891b98c">3.2. Text Editing</a></li>
<li><a href="#orgc33ac62">3.3. String Functions</a></li>
<li><a href="#orgf5c74c6">3.4. Buffer</a>
<ul>
<li><a href="#org11969dc">3.4.1. Switch Buffer</a></li>
<li><a href="#org7c4c528">3.4.2. Create Buffer</a></li>
</ul>
</li>
<li><a href="#org3345602">3.5. File</a>
<ul>
<li><a href="#orgab26260">3.5.1. Open File</a></li>
<li><a href="#org1fa1403">3.5.2. wrtie file</a></li>
<li><a href="#org8d45851">3.5.3. Append File</a></li>
<li><a href="#org7e47862">3.5.4. Close File</a></li>
<li><a href="#orgd119ab6">3.5.5. Create New File</a></li>
<li><a href="#org7d5e826">3.5.6. with-temp-file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdf834c0">4. File/Dir Path</a>
<ul>
<li>
<ul>
<li><a href="#orgc487c0b">4.0.1. Function on File</a></li>
<li><a href="#org6b74a86">4.0.2. Functions on Directory</a></li>
<li><a href="#orge39536b">4.0.3. File Path Functions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-extension</span> <span style="color: #99bb66;">"tring.org"</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div id="outline-container-org5786feb" class="outline-2">
<h2 id="org5786feb"><span class="section-number-2">1</span> Basics</h2>
<div class="outline-text-2" id="text-1">
<p>
true ===&gt; t, 0, &ldquo;&rdquo;, []
false ===&gt; nil, (), (empty), &rsquo;()
and , or
/= not equal
</p>


<p>
string comaprision
(string-equal &ldquo;abc&rdquo; &ldquo;abc&rdquo;)
(not (string-equal &ldquo;abc&rdquo; &ldquo;abc&rdquo;)))
</p>
</div>


<div id="outline-container-org52a75ad" class="outline-3">
<h3 id="org52a75ad"><span class="section-number-3">1.1</span> (setq a 3 b 4 c 5)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
(let (a,b)
(setq a 3)
(setq b 4)
(+ a b)
) ; last statemet return of local variable
</p>
</div>
</div>
<div id="outline-container-orgd36cfd5" class="outline-3">
<h3 id="orgd36cfd5"><span class="section-number-3">1.2</span> if</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(if (&lt; 3 2) 5 6) ;  6
</p>
</div>
</div>
<div id="outline-container-org7d0c738" class="outline-3">
<h3 id="org7d0c738"><span class="section-number-3">1.3</span> when</h3>
<div class="outline-text-3" id="text-1-3">
<p>
(when test expr1 expr2 …)
(if test progn ( exp1 exp2))
progn return last state ment in his body ( progn = {} )
</p>
</div>
</div>
<div id="outline-container-orgcc89c53" class="outline-3">
<h3 id="orgcc89c53"><span class="section-number-3">1.4</span> Loop</h3>
<div class="outline-text-3" id="text-1-4">
<p>
(setq x 0)
</p>

<p>
(while (&lt; x 4)
  (print (format &ldquo;number is %d&rdquo; x))
  (setq x (1+ x)))
</p>
</div>
</div>
</div>
<div id="outline-container-orgb80c6ac" class="outline-2">
<h2 id="orgb80c6ac"><span class="section-number-2">2</span> Basics</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8cb32c8" class="outline-3">
<h3 id="org8cb32c8"><span class="section-number-3">2.1</span> Elisp Basics</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<ol class="org-ol">
<li><a id="orga16ef02"></a>printing<br />
<div class="outline-text-5" id="text-2-1-0-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">; </span><span style="color: #525252;">printing</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">"hi"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">; </span><span style="color: #525252;">printing variable values</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">"Her age is: %d"</span> <span style="color: #dd8844; font-weight: bold;">16</span><span style="color: #51afef;">)</span>        <span style="color: #525252;">; </span><span style="color: #525252;">%d is for number</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">"Her name is: %s"</span> <span style="color: #99bb66;">"Vicky"</span><span style="color: #51afef;">)</span>  <span style="color: #525252;">; </span><span style="color: #525252;">%s is for string</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">"My list is: %S"</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">list</span> <span style="color: #dd8844; font-weight: bold;">8</span> <span style="color: #dd8844; font-weight: bold;">2</span> <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>  <span style="color: #525252;">; </span><span style="color: #525252;">%S is for any lisp expression</span>
</pre>
</div>
</div>
</li>
<li><a id="org8116256"></a>Convert Float/Integer<br />
<div class="outline-text-5" id="text-2-1-0-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">int to float</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">float</span> <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">3.0</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">truncate</span> <span style="color: #dd8844; font-weight: bold;">3.3</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">3</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">floor</span> <span style="color: #dd8844; font-weight: bold;">3.3</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">3</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">ceiling</span> <span style="color: #dd8844; font-weight: bold;">3.3</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">4</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">round</span> <span style="color: #dd8844; font-weight: bold;">3.4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">3</span>

</pre>
</div>
</div>
</li>
<li><a id="orgf9583db"></a>True/False<br />
<div class="outline-text-5" id="text-2-1-0-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">all the following are false. They all evaluate to nil</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> nil <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"no"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">()</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"no"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">()</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"no"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">list</span><span style="color: #c678dd;">)</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"no", because (list) eval to a empty list, same as ()</span>




<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> t <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"yes"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #dd8844; font-weight: bold;">0</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"yes"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #99bb66;">""</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"yes"</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">[]</span> <span style="color: #99bb66;">"yes"</span> <span style="color: #99bb66;">"no"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">"yes". The [] is vector of 0 elements</span>
</pre>
</div>
</div>
</li>
