posts/elisp.org
**** Boolean Functions
#+BEGIN_SRC emacs-lisp
(and t nil) ; nil
(or t nil) ; t
(and t nil t t t t) ; nil
;;;;;;;;;;;;;;;;;;;;;;;;;;;;Comapiring number
(< 3 4) ; less than
(> 3 4) ; greater than

(<= 3 4) ; less or equal to
(>= 3 4) ; greater or equal to

(= 3 3)   ;  t
(= 3 3.00000000000000001) ;  t

(/= 3 4) ; not equal. ⇒ t
;;;;;;;;;;;;;;;;;;;;String
;; compare string
(equal "abc" "abc") ;  t

;; dedicated function for comparing string
(string-equal "abc" "abc") ;  t

(string-equal "abc" "Abc") ;  nil. Case matters

;; can be used to compare string and symbol
(string-equal "abc" 'abc) ;  t
;;;;;;;;;;;;;;;;; Equal
;; test if two values have the same datatype and value.

(equal 3 3) ;  t
(equal 3.0 3.0) ;  t

(equal 3 3.0) ;  nil. Because datatype doesn't match.

;; test equality of lists
(equal '(3 4 5) '(3 4 5))  ;  t
(equal '(3 4 5) '(3 4 "5")) ;  nil

;; test equality of strings
(equal "e" "e") ;  t

;; test equality of symbols
(equal 'abc 'abc) ;  t
;;;;;;;;;;;;;;;;;;

(not (= 3 4)) ;  t
(/= 3 4) ;  t. “/=” is for comparing numbers only

(not (equal 3 4)) ;  t. General way to test inequality.


(setq x 1) ; assign 1 to x
(setq a 3 b 2 c 7) ; multiple assignment

(let (a b)
 (setq a 3)
 (setq b 4)
 (+ a b)
) ;  7

(let ((a 3) (b 4))
 (+ a b)
) ;  7

#+END_SRC
**** if then else
#+BEGIN_SRC emacs-lisp
(if (< 3 2) 7 8 ) ; 8

;; no false expression, return nil
(if (< 3 2) (message "yes") ) ; nil
;;;;;; (when test exp1 exp2)
;;;; (if test (progn  expr1 expr2))

#+END_SRC
**** Loop
#+BEGIN_SRC emacs-lisp
(setq x 0)

(while (< x 4)
  (print (format "number is %d" x))
  (setq x (1+ x)))

#+END_SRC

