posts/elisp.html
<li><a id="org9739730"></a>Boolean Functions<br />
<div class="outline-text-5" id="text-2-1-0-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> t nil<span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">nil</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">or</span> t nil<span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">t</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">and</span> t nil t t t t<span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">nil</span>
<span style="color: #525252;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span><span style="color: #525252;">Comapiring number</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">&lt;</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">less than</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">&gt;</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">greater than</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">&lt;=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">less or equal to</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">&gt;=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">greater or equal to</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #51afef;">)</span>   <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">3.00000000000000001</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">/=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">not equal. &#8658; t</span>
<span style="color: #525252;">;;;;;;;;;;;;;;;;;;;;</span><span style="color: #525252;">String</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">compare string</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #99bb66;">"abc"</span> <span style="color: #99bb66;">"abc"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">dedicated function for comparing string</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">string-equal</span> <span style="color: #99bb66;">"abc"</span> <span style="color: #99bb66;">"abc"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">string-equal</span> <span style="color: #99bb66;">"abc"</span> <span style="color: #99bb66;">"Abc"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">nil. Case matters</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">can be used to compare string and symbol</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">string-equal</span> <span style="color: #99bb66;">"abc"</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">abc</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #525252;">;;;;;;;;;;;;;;;;; </span><span style="color: #525252;">Equal</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">test if two values have the same datatype and value.</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #dd8844; font-weight: bold;">3.0</span> <span style="color: #dd8844; font-weight: bold;">3.0</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">3.0</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">nil. Because datatype doesn't match.</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">test equality of lists</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span> <span style="color: #dd8844; font-weight: bold;">5</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span> <span style="color: #dd8844; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>  <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span> <span style="color: #dd8844; font-weight: bold;">5</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span> <span style="color: #99bb66;">"5"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">nil</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">test equality of strings</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #99bb66;">"e"</span> <span style="color: #99bb66;">"e"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">test equality of symbols</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">abc</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">abc</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #525252;">;;;;;;;;;;;;;;;;;;</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">not</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">/=</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t. &#8220;/=&#8221; is for comparing numbers only</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">not</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">equal</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">t. General way to test inequality.</span>


<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> x <span style="color: #dd8844; font-weight: bold;">1</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">assign 1 to x</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> a <span style="color: #dd8844; font-weight: bold;">3</span> b <span style="color: #dd8844; font-weight: bold;">2</span> c <span style="color: #dd8844; font-weight: bold;">7</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">multiple assignment</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span>a b<span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> a <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> b <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">+</span> a b<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">7</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #99bb66;">(</span>a <span style="color: #dd8844; font-weight: bold;">3</span><span style="color: #99bb66;">)</span> <span style="color: #99bb66;">(</span>b <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">+</span> a b<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span> <span style="color: #525252;">;  </span><span style="color: #525252;">7</span>

</pre>
</div>
</div>
</li>
<li><a id="org023ac2b"></a>if then else<br />
<div class="outline-text-5" id="text-2-1-0-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">&lt;</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">2</span><span style="color: #c678dd;">)</span> <span style="color: #dd8844; font-weight: bold;">7</span> <span style="color: #dd8844; font-weight: bold;">8</span> <span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">8</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">no false expression, return nil</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">&lt;</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">2</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">"yes"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">nil</span>
<span style="color: #525252;">;;;;;; </span><span style="color: #525252;">(when test exp1 exp2)</span>
<span style="color: #525252;">;;;; </span><span style="color: #525252;">(if test (progn  expr1 expr2))</span>

</pre>
</div>
</div>
</li>
