posts/elisp.org
**** Define a function
#+BEGIN_SRC emacs-lisp
(defun myFuntion ()
"testing"
(message 'yay!@')
;;;;;; Eval Expression C-x C-e
;;;;;;;;;;;;;;;;;;;; execute C-c C-c

#+END_SRC
** ELisp Text-Processing overview
*** Cursor Position
#+BEGIN_SRC emacs-lisp
;; current cursor position is called “point”.
;; Left of first char in buffer is 1
;; This returns the current cursor position
(point)

;; returns the position of the beginning/end of region (selection)
(region-beginning)
(region-end)

;; position for beginning/ending of current line
(line-beginning-position)
(line-end-position)

;; returns the position for the beginning/end of buffer, taking account of narrow-to-region
(point-min)
(point-max)
#+END_SRC
*** Move Cursor, Search Text
#+BEGIN_SRC emacs-lisp
;; move cursor to position 39
(goto-char 39)

;; move cursor by 4 chars
(forward-char 4)
(backward-char 4)

;; move cursor to the location of a string
;; returns the new position
(search-forward "some") ; to end of “some”
(search-backward "some") ; to beginning of “some”

;; move cursor to the location matched by a regex
;; returns the new position
(re-search-forward "[0-9]") ; digit
(re-search-backward "[0-9]")

;; move cursor to the first char that's not “a to z”
;; Returns the distance traveled.
(skip-chars-forward "a-z")
(skip-chars-backward "a-z")
#+END_SRC
*** Delete, insert, change, Text
#+BEGIN_SRC emacs-lisp
;; delete 9 chars starting at current cursor pos
(delete-char 9)

;; deleting text from pos 3 to 10
(delete-region 3 10)

;; insert string at current cursor position
(insert "i ♥ cats")

;; get the string from pos 71 to 300
(setq x (buffer-substring 71 300))

;; capitalize letters in a region
(capitalize-region 71 300)

#+END_SRC
*** String
#+BEGIN_SRC emacs-lisp
;; length
(length "abc")
; returns 3

;; substring
(substring "abcdefg" 3 4)
; returns "d"

;; change a given string using regex
(replace-regexp-in-string "[0-9]" "X" "abc123")
;; returns "abcXXX
#+END_SRC
*** Buffer
#+BEGIN_SRC emacs-lisp
;; return the name of current buffer
(buffer-name)

;; return the full path of current file
(buffer-file-name)

;; switch to the buffer named xyz
(set-buffer "xyz")

;; save current buffer
(save-buffer)

;; close a buffer named xyz
(kill-buffer "xyz")

;; temporarily sets a buffer as current to work with
(with-current-buffer "xyz"
  ;; do something here. delete/insert text, etc.
#+END_SRC
