posts/elisp.html
<li><a id="org6400c36"></a>Loop<br />
<div class="outline-text-5" id="text-2-1-0-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> x <span style="color: #dd8844; font-weight: bold;">0</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">&lt;</span> x <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">print</span> <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">format</span> <span style="color: #99bb66;">"number is %d"</span> x<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> x <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">1+</span> x<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</li>

<li><a id="orga7bd4f0"></a>Define a function<br />
<div class="outline-text-5" id="text-2-1-0-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">myFuntion</span> <span style="color: #c678dd;">()</span>
<span style="color: #7d7d7d;">"testing"</span>
<span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">yay!@</span><span style="color: #51afef;">'</span><span style="color: #c678dd;">)</span>
<span style="color: #525252;">;;;;;; </span><span style="color: #525252;">Eval Expression C-x C-e</span>
<span style="color: #525252;">;;;;;;;;;;;;;;;;;;;; </span><span style="color: #525252;">execute C-c C-c</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org12b5732" class="outline-3">
<h3 id="org12b5732"><span class="section-number-3">2.2</span> ELisp Text-Processing overview</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgf968653" class="outline-4">
<h4 id="orgf968653"><span class="section-number-4">2.2.1</span> Cursor Position</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">current cursor position is called &#8220;point&#8221;.</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">Left of first char in buffer is 1</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">This returns the current cursor position</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">point</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">returns the position of the beginning/end of region (selection)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">region-beginning</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">region-end</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">position for beginning/ending of current line</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">line-beginning-position</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">line-end-position</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">returns the position for the beginning/end of buffer, taking account of narrow-to-region</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">point-min</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">point-max</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd6e3fc" class="outline-4">
<h4 id="orgdd6e3fc"><span class="section-number-4">2.2.2</span> Move Cursor, Search Text</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">move cursor to position 39</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #dd8844; font-weight: bold;">39</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">move cursor by 4 chars</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">forward-char</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">backward-char</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">move cursor to the location of a string</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">returns the new position</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">search-forward</span> <span style="color: #99bb66;">"some"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">to end of &#8220;some&#8221;</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">search-backward</span> <span style="color: #99bb66;">"some"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">to beginning of &#8220;some&#8221;</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">move cursor to the location matched by a regex</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">returns the new position</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">re-search-forward</span> <span style="color: #99bb66;">"[0-9]"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">digit</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">re-search-backward</span> <span style="color: #99bb66;">"[0-9]"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">move cursor to the first char that's not &#8220;a to z&#8221;</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">Returns the distance traveled.</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">skip-chars-forward</span> <span style="color: #99bb66;">"a-z"</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">skip-chars-backward</span> <span style="color: #99bb66;">"a-z"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc8c5be9" class="outline-4">
<h4 id="orgc8c5be9"><span class="section-number-4">2.2.3</span> Delete, insert, change, Text</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">delete 9 chars starting at current cursor pos</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">delete-char</span> <span style="color: #dd8844; font-weight: bold;">9</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">deleting text from pos 3 to 10</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">delete-region</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">10</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">insert string at current cursor position</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"i &#9829; cats"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get the string from pos 71 to 300</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> x <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">buffer-substring</span> <span style="color: #dd8844; font-weight: bold;">71</span> <span style="color: #dd8844; font-weight: bold;">300</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">capitalize letters in a region</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">capitalize-region</span> <span style="color: #dd8844; font-weight: bold;">71</span> <span style="color: #dd8844; font-weight: bold;">300</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd7db4d" class="outline-4">
<h4 id="orgcd7db4d"><span class="section-number-4">2.2.4</span> String</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">length</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">length</span> <span style="color: #99bb66;">"abc"</span><span style="color: #51afef;">)</span>
<span style="color: #525252;">; </span><span style="color: #525252;">returns 3</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">substring</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">substring</span> <span style="color: #99bb66;">"abcdefg"</span> <span style="color: #dd8844; font-weight: bold;">3</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span>
<span style="color: #525252;">; </span><span style="color: #525252;">returns "d"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">change a given string using regex</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">replace-regexp-in-string</span> <span style="color: #99bb66;">"[0-9]"</span> <span style="color: #99bb66;">"X"</span> <span style="color: #99bb66;">"abc123"</span><span style="color: #51afef;">)</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">returns "abcXXX</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgece3e88" class="outline-4">
<h4 id="orgece3e88"><span class="section-number-4">2.2.5</span> Buffer</h4>
<div class="outline-text-4" id="text-2-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">return the name of current buffer</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">buffer-name</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">return the full path of current file</span>
<span style="color: #51afef;">(</span><span style="color: #dcaeea;">buffer-file-name</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">switch to the buffer named xyz</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">set-buffer</span> <span style="color: #99bb66;">"xyz"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">save current buffer</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">save-buffer</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">close a buffer named xyz</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">kill-buffer</span> <span style="color: #99bb66;">"xyz"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">temporarily sets a buffer as current to work with</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">with-current-buffer</span> <span style="color: #99bb66;">"xyz"</span>
  <span style="color: #525252;">;; </span><span style="color: #525252;">do something here. delete/insert text, etc.</span>
</pre>
</div>
</div>
</div>
