posts/elisp.html
<div id="outline-container-org88114dc" class="outline-4">
<h4 id="org88114dc"><span class="section-number-4">2.2.6</span> File</h4>
<div class="outline-text-4" id="text-2-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">open a file (in a buffer)</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">find-file</span> <span style="color: #99bb66;">"~/"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">same as &#8220;Save As&#8221;.</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">write-file</span> path<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">insert file into current position</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">insert-file-contents</span> path<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">append a text block to file</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">append-to-file</span> start-pos end-pos path<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">renaming file</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">rename-file</span> file-name new-name<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">copying file</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">copy-file</span> old-name new-name<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">deleting file</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">delete-file</span> file-name<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get dir path</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-name-directory</span> full-path<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename part</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-name-nondirectory</span> full-path<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename's suffix</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-extension</span> file-name<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename sans suffix</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-sans-extension</span> file-name<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3bcd0e" class="outline-4">
<h4 id="orgf3bcd0e"><span class="section-number-4">2.2.7</span> Simple Example</h4>
<div class="outline-text-4" id="text-2-2-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">insert-p-tag</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Insert &lt;p&gt;&lt;/p&gt; at cursor point."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"&lt;p&gt;&lt;/p&gt;"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">backward-char</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3899158" class="outline-3">
<h3 id="org3899158"><span class="section-number-3">2.3</span> Elisp Examples</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org5b958e5" class="outline-4">
<h4 id="org5b958e5"><span class="section-number-4">2.3.1</span> Insert Text</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">insert-p-tag</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Insert &lt;p&gt;&lt;/p&gt; at cursor point."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"&lt;p&gt;&lt;/p&gt;"</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">backward-char</span> <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org47ae068" class="outline-4">
<h4 id="org47ae068"><span class="section-number-4">2.3.2</span> insert around region</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">wrap-markup-region</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Insert a markup &lt;b&gt;&lt;/b&gt; around a region."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">save-excursion</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">region-end</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"&lt;/b&gt;"</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">region-beginning</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"&lt;b&gt;"</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0798fd7" class="outline-4">
<h4 id="org0798fd7"><span class="section-number-4">2.3.3</span> Select current Word</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">turn on highlight selection</span>
<span style="color: #51afef;">(</span><span style="color: #dcaeea;">transient-mark-mode</span> <span style="color: #dd8844; font-weight: bold;">1</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">select-current-word</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Select the word under cursor.</span>
<span style="color: #7d7d7d;">&#8220;word&#8221; here is considered any alphanumeric sequence with &#8220;_&#8221; or &#8220;-&#8221;."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span>pt<span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">skip-chars-backward</span> <span style="color: #99bb66;">"-_A-Za-z0-9"</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">setq</span> pt <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">point</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">skip-chars-forward</span> <span style="color: #99bb66;">"-_A-Za-z0-9"</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #c678dd;">set-mark</span> pt<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8132d0" class="outline-4">
<h4 id="orgb8132d0"><span class="section-number-4">2.3.4</span> Select Current Line</h4>
<div class="outline-text-4" id="text-2-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">turn on highlight selection</span>
<span style="color: #51afef;">(</span><span style="color: #dcaeea;">transient-mark-mode</span> <span style="color: #dd8844; font-weight: bold;">1</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">select-current-line</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Select the current line"</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span>pos <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">line-beginning-position</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">end-of-line</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #c678dd;">set-mark</span> pos<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
