posts/elisp.org
*** Find Replace String in Region
#+BEGIN_SRC emacs-lisp
(defun replace-greek-region ()
  "Replace “alpha” to “α” and other greek letters in current region."
  (interactive)
  (let (
        (p1 (region-beginning))
        (p2 (region-end)))
    (save-restriction
      (narrow-to-region p1 p2)
      (goto-char (point-min))
      (while (search-forward " alpha" nil t)
        (replace-match " α" nil t))
      (goto-char (point-min))
      (while (search-forward " beta" nil t)
        (replace-match " β" nil t))
      (goto-char (point-min))
      (while (search-forward " gamma" nil t)
        (replace-match " γ" nil t)))))
#+END_SRC
*** delete enclosed text
#+BEGIN_SRC emacs-lisp
(defun delete-enclosed-text ()
  "Delete texts between any pair of delimiters."
  (interactive)
  (save-excursion
    (let (p1 p2)
      (skip-chars-backward "^([<>“")
      (setq p1 (point))
      (skip-chars-forward "^)]<>”")
      (setq p2 (point))
      (delete-region p1 p2))))
#+END_SRC
** Delete Linebreaks
#+BEGIN_SRC emacs-lisp
(defun remove-line-breaks ()
  "Remove line endings in current paragraph."
  (interactive)
  (let ((fill-column (point-max)))
    (fill-paragraph nil)))
#+END_SRC
*** Random Number
#+BEGIN_SRC emacs-lisp
(random 99999)
#+END_SRC

*** Reference LookUP
#+BEGIN_SRC emacs-lisp
(defun word-definition-lookup ()
"Look up the word under cursor in a browser."
 (interactive)
 (browse-url
   (concat "http://www.answers.com/main/ntquery?s=" (thing-at-point 'sentence))))
#+END_SRC
*** Change Newline Character
#+BEGIN_SRC emacs-lisp
(defun to-unix-eol (fPath)
  "Change file's line ending to unix convention."
  (interactive)
  (let ((myBuffer (find-file fPath)))
    (set-buffer-file-coding-system 'unix) ; or 'mac or 'dos
    (save-buffer)
    (kill-buffer myBuffer)))
#+END_SRC

#+RESULTS:
: to-unix-eol
*** Delete Currente File
#+BEGIN_SRC emacs-lisp
(defun delete-current-file ()
  "Delete the file associated with the current buffer.
Delete the current buffer too.
If no file is associated, just close buffer without prompt for save."
  (interactive)
  (let ((currentFile (buffer-file-name)))
    (when (yes-or-no-p (concat "Delete file?: " currentFile))
      (kill-buffer (current-buffer))
      (when currentFile
        (delete-file currentFile)))))

#+END_SRC
