posts/elisp.html
<div id="outline-container-org4376694" class="outline-4">
<h4 id="org4376694"><span class="section-number-4">2.3.5</span> Find Replace String in Region</h4>
<div class="outline-text-4" id="text-2-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">replace-greek-region</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Replace &#8220;alpha&#8221; to &#8220;&#945;&#8221; and other greek letters in current region."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span>
        <span style="color: #51afef;">(</span>p1 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">region-beginning</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        <span style="color: #51afef;">(</span>p2 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">region-end</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">save-restriction</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">narrow-to-region</span> p1 p2<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point-min</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">search-forward</span> <span style="color: #99bb66;">" alpha"</span> nil t<span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">replace-match</span> <span style="color: #99bb66;">" &#945;"</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point-min</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">search-forward</span> <span style="color: #99bb66;">" beta"</span> nil t<span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">replace-match</span> <span style="color: #99bb66;">" &#946;"</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point-min</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">while</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">search-forward</span> <span style="color: #99bb66;">" gamma"</span> nil t<span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">replace-match</span> <span style="color: #99bb66;">" &#947;"</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9deaf70" class="outline-4">
<h4 id="org9deaf70"><span class="section-number-4">2.3.6</span> delete enclosed text</h4>
<div class="outline-text-4" id="text-2-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">delete-enclosed-text</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Delete texts between any pair of delimiters."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">save-excursion</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">let</span> <span style="color: #51afef;">(</span>p1 p2<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">skip-chars-backward</span> <span style="color: #99bb66;">"^([&lt;&gt;&#8220;"</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> p1 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">skip-chars-forward</span> <span style="color: #99bb66;">"^)]&lt;&gt;&#8221;"</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> p2 <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">delete-region</span> p1 p2<span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb682ed3" class="outline-3">
<h3 id="orgb682ed3"><span class="section-number-3">2.4</span> Delete Linebreaks</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">remove-line-breaks</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Remove line endings in current paragraph."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">fill-column</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point-max</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #c678dd;">fill-paragraph</span> nil<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org7f96d00" class="outline-4">
<h4 id="org7f96d00"><span class="section-number-4">2.4.1</span> Random Number</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">random</span> <span style="color: #dd8844; font-weight: bold;">99999</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5873abe" class="outline-4">
<h4 id="org5873abe"><span class="section-number-4">2.4.2</span> Reference LookUP</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">word-definition-lookup</span> <span style="color: #c678dd;">()</span>
<span style="color: #7d7d7d;">"Look up the word under cursor in a browser."</span>
 <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #c678dd;">browse-url</span>
   <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #99bb66;">"http://www.answers.com/main/ntquery?s="</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">thing-at-point</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">sentence</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd745e30" class="outline-4">
<h4 id="orgd745e30"><span class="section-number-4">2.4.3</span> Change Newline Character</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">to-unix-eol</span> <span style="color: #c678dd;">(</span>fPath<span style="color: #c678dd;">)</span>
  <span style="color: #7d7d7d;">"Change file's line ending to unix convention."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span>myBuffer <span style="color: #c678dd;">(</span><span style="color: #c678dd;">find-file</span> fPath<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #c678dd;">set-buffer-file-coding-system</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">unix</span><span style="color: #99bb66;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">or 'mac or 'dos</span>
    <span style="color: #99bb66;">(</span><span style="color: #c678dd;">save-buffer</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">kill-buffer</span> myBuffer<span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org47b0ffc" class="outline-4">
<h4 id="org47b0ffc"><span class="section-number-4">2.4.4</span> Delete Currente File</h4>
<div class="outline-text-4" id="text-2-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">delete-current-file</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Delete the file associated with the current buffer.</span>
<span style="color: #7d7d7d;">Delete the current buffer too.</span>
<span style="color: #7d7d7d;">If no file is associated, just close buffer without prompt for save."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span>currentFile <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">buffer-file-name</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">when</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">yes-or-no-p</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #99bb66;">"Delete file?: "</span> currentFile<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">kill-buffer</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">current-buffer</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">when</span> currentFile
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">delete-file</span> currentFile<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</div>
