posts/elisp.org
*** Insert Vertical Column of Numbers
#+BEGIN_SRC emacs-lisp
(defun insert-column-counter (n)
  "deocjdkfjdkf.............."
  (interactive "nEnter the max integer: ")
  (let ((i 1) colpos)
    (setq colpos (- (point) (line-beginning-position)))
    (while (<= i n)
      (insert (number-to-string i))
      (forward-line)
      (beginning-of-line)
      (forward-char colpos)
      (setq i (1+ i))
      )
    )

  )
#+END_SRC
** Evaluate Elisp Code
eval-buffer
eval-region
** Doc lookUp
*** LookUp Function Doc String
you can use * in Describe Functions
** Search Doc
- search command ===> C-h a
- search command and function ====> C-u C-h a
- M-x : apropos-variable
- M-x : apropos - value
- To find function documentation M-x : emacs -index-search

* Basic Funtions
** Get Cursor Position
- point
- save-excursion
- re-serach-forward
- search-backward
- skip-chars-backward
- beginning-of-line
- end-of-line
- region-beginning
- goto-char
- forward-char
** Text Editing
- delete-char
- delete-region
- erase-buffer
- delete-and-extract-region
** String Functions
- (match-string 1 myhStr)  ======> match-data
- replace-regexp-in-string myRegex myreplacement mystr
- (split-string 'xy_007_cat' "_")
- string to number
- number-to-string
- string-join
- concat
- string-trim, left, right
- string-reverse ==========>  (require 'subr-x)
- format
***** String to Buffer
If you got a big string already somehow, you can put into a buffer by using with-temp-buffer, then insert your string, process it, then use buffer-string to get the whole buffer content.
#+BEGIN_SRC emacs-lisp
;; process string in a temp buffer

(with-temp-buffer
  (insert bigString)

  (goto-char (point-min))

  ;; code to manipulate string. eg delete char, etc

  ;; return whole buffer string
  (buffer-string))
#+END_SRC
** Buffer
- buffer-name
- buffer-file-name (full path of the file)
- set-buffer
*** Switch Buffer
with-current-buffer → temporarily make a buffer current.

Most of the time, you want to use this. Because it takes care of switching back to the original buffer when the function is done.
#+BEGIN_SRC emacs-lisp
;; make myBuf current temporarily
(with-current-buffer myBuf
  ;; code to edit text here
)
(save-current-buffer

  ;; switch to myBuf
  (set-buffer myBuf)

  ;; do stuff, such as insert/delete text
  )
#+END_SRC
*** Create Buffer
- with-temp-buffer
  (with-temp-buffer &rest BODY)
  Create a temporary buffer, and evaluate BODY there like progn.
- geneerate-new-buffer
  Create and return a buffer with a name based on NAME. Buffer name is created by calling generate-new-buffer-name.
- get-buffer-create
  ()Returns the buffer, but doesn't make it current. use set-buffer to make it current.
- kill buffer
** File
*** Open File
(find-file FILENAME &optional WILDCARDS)
*** wrtie file
(write-region start end filename-created &optional Append visit loackname mustbenew)
(save-buffer)
(write-file '~/new.txt')
*** Append File
(append-to-file 100 200 "~/test.txt") ------> current-buffer positions saves to file
*** Close File
kill-buffer
*** Create New File
find-file FILENAME  &Optional WILDCARDS
#+BEGIN_SRC emacs-lisp
(setq newBufName " xyz")

;; create a new buffer, save it to a var, so later you can switch to it or kill it
(setq newBuf (generate-new-buffer newBufName))

;; make it current (but does not make it visible), so all insert etc operations works on it.
(set-buffer newBuf)

;; like “Save As”. Save current buffer, close it, and open the new saved
(write-file "~/new.txt")

;; close it
(kill-buffer newBuf)
#+END_SRC
