posts/elisp.html
<div id="outline-container-orgc967d6e" class="outline-4">
<h4 id="orgc967d6e"><span class="section-number-4">2.4.5</span> Insert Vertical Column of Numbers</h4>
<div class="outline-text-4" id="text-2-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">insert-column-counter</span> <span style="color: #c678dd;">(</span>n<span style="color: #c678dd;">)</span>
  <span style="color: #7d7d7d;">"deocjdkfjdkf.............."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span> <span style="color: #99bb66;">"nEnter the max integer: "</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span>i <span style="color: #dd8844; font-weight: bold;">1</span><span style="color: #51afef;">)</span> colpos<span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">setq</span> colpos <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">-</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">line-beginning-position</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">while</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">&lt;=</span> i n<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">number-to-string</span> i<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">forward-line</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">beginning-of-line</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">forward-char</span> colpos<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> i <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">1+</span> i<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #99bb66;">)</span>
    <span style="color: #c678dd;">)</span>

  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org215d392" class="outline-3">
<h3 id="org215d392"><span class="section-number-3">2.5</span> Evaluate Elisp Code</h3>
<div class="outline-text-3" id="text-2-5">
<p>
eval-buffer
eval-region
</p>
</div>
</div>
<div id="outline-container-org7b75aa8" class="outline-3">
<h3 id="org7b75aa8"><span class="section-number-3">2.6</span> Doc lookUp</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org8eddb24" class="outline-4">
<h4 id="org8eddb24"><span class="section-number-4">2.6.1</span> LookUp Function Doc String</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
you can use * in Describe Functions
</p>
</div>
</div>
</div>
<div id="outline-container-org82b69cc" class="outline-3">
<h3 id="org82b69cc"><span class="section-number-3">2.7</span> Search Doc</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>search command ===&gt; C-h a</li>
<li>search command and function ====&gt; C-u C-h a</li>
<li>M-x : apropos-variable</li>
<li>M-x : apropos - value</li>
<li>To find function documentation M-x : emacs -index-search</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org65b9a74" class="outline-2">
<h2 id="org65b9a74"><span class="section-number-2">3</span> Basic Funtions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge317739" class="outline-3">
<h3 id="orge317739"><span class="section-number-3">3.1</span> Get Cursor Position</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>point</li>
<li>save-excursion</li>
<li>re-serach-forward</li>
<li>search-backward</li>
<li>skip-chars-backward</li>
<li>beginning-of-line</li>
<li>end-of-line</li>
<li>region-beginning</li>
<li>goto-char</li>
<li>forward-char</li>
</ul>
</div>
</div>
<div id="outline-container-org891b98c" class="outline-3">
<h3 id="org891b98c"><span class="section-number-3">3.2</span> Text Editing</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>delete-char</li>
<li>delete-region</li>
<li>erase-buffer</li>
<li>delete-and-extract-region</li>
</ul>
</div>
</div>
<div id="outline-container-orgc33ac62" class="outline-3">
<h3 id="orgc33ac62"><span class="section-number-3">3.3</span> String Functions</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>(match-string 1 myhStr)  ======&gt; match-data</li>
<li>replace-regexp-in-string myRegex myreplacement mystr</li>
<li>(split-string &rsquo;xy<sub>007</sub><sub>cat</sub>&rsquo; &ldquo;_&rdquo;)</li>
<li>string to number</li>
<li>number-to-string</li>
<li>string-join</li>
<li>concat</li>
<li>string-trim, left, right</li>
<li>string-reverse ==========&gt;  (require &rsquo;subr-x)</li>
<li>format</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgccf6dca"></a>String to Buffer<br />
<div class="outline-text-6" id="text-3-3-0-0-1">
<p>
If you got a big string already somehow, you can put into a buffer by using with-temp-buffer, then insert your string, process it, then use buffer-string to get the whole buffer content.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">process string in a temp buffer</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">with-temp-buffer</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">insert</span> bigString<span style="color: #c678dd;">)</span>

  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">point-min</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span>

  <span style="color: #525252;">;; </span><span style="color: #525252;">code to manipulate string. eg delete char, etc</span>

  <span style="color: #525252;">;; </span><span style="color: #525252;">return whole buffer string</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">buffer-string</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf5c74c6" class="outline-3">
<h3 id="orgf5c74c6"><span class="section-number-3">3.4</span> Buffer</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>buffer-name</li>
<li>buffer-file-name (full path of the file)</li>
<li>set-buffer</li>
</ul>
</div>
<div id="outline-container-org11969dc" class="outline-4">
<h4 id="org11969dc"><span class="section-number-4">3.4.1</span> Switch Buffer</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
with-current-buffer → temporarily make a buffer current.
</p>

<p>
Most of the time, you want to use this. Because it takes care of switching back to the original buffer when the function is done.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">make myBuf current temporarily</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">with-current-buffer</span> myBuf
  <span style="color: #525252;">;; </span><span style="color: #525252;">code to edit text here</span>
<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">save-current-buffer</span>

  <span style="color: #525252;">;; </span><span style="color: #525252;">switch to myBuf</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">set-buffer</span> myBuf<span style="color: #c678dd;">)</span>

  <span style="color: #525252;">;; </span><span style="color: #525252;">do stuff, such as insert/delete text</span>
  <span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c4c528" class="outline-4">
<h4 id="org7c4c528"><span class="section-number-4">3.4.2</span> Create Buffer</h4>
<div class="outline-text-4" id="text-3-4-2">
<ul class="org-ul">
<li>with-temp-buffer
(with-temp-buffer &amp;rest BODY)
Create a temporary buffer, and evaluate BODY there like progn.</li>
<li>geneerate-new-buffer
Create and return a buffer with a name based on NAME. Buffer name is created by calling generate-new-buffer-name.</li>
<li>get-buffer-create
()Returns the buffer, but doesn&rsquo;t make it current. use set-buffer to make it current.</li>
<li>kill buffer</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3345602" class="outline-3">
<h3 id="org3345602"><span class="section-number-3">3.5</span> File</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orgab26260" class="outline-4">
<h4 id="orgab26260"><span class="section-number-4">3.5.1</span> Open File</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
(find-file FILENAME &amp;optional WILDCARDS)
</p>
</div>
</div>
<div id="outline-container-org1fa1403" class="outline-4">
<h4 id="org1fa1403"><span class="section-number-4">3.5.2</span> wrtie file</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
(write-region start end filename-created &amp;optional Append visit loackname mustbenew)
(save-buffer)
(write-file &rsquo;~/new.txt&rsquo;)
</p>
</div>
</div>
<div id="outline-container-org8d45851" class="outline-4">
<h4 id="org8d45851"><span class="section-number-4">3.5.3</span> Append File</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
(append-to-file 100 200 &ldquo;~/test.txt&rdquo;) -&#x2013;&#x2014;&gt; current-buffer positions saves to file
</p>
</div>
</div>
<div id="outline-container-org7e47862" class="outline-4">
<h4 id="org7e47862"><span class="section-number-4">3.5.4</span> Close File</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
kill-buffer
</p>
</div>
</div>
<div id="outline-container-orgd119ab6" class="outline-4">
<h4 id="orgd119ab6"><span class="section-number-4">3.5.5</span> Create New File</h4>
<div class="outline-text-4" id="text-3-5-5">
<p>
find-file FILENAME  &amp;Optional WILDCARDS
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> newBufName <span style="color: #99bb66;">" xyz"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">create a new buffer, save it to a var, so later you can switch to it or kill it</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> newBuf <span style="color: #c678dd;">(</span><span style="color: #c678dd;">generate-new-buffer</span> newBufName<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">make it current (but does not make it visible), so all insert etc operations works on it.</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">set-buffer</span> newBuf<span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">like &#8220;Save As&#8221;. Save current buffer, close it, and open the new saved</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">write-file</span> <span style="color: #99bb66;">"~/new.txt"</span><span style="color: #51afef;">)</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">close it</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">kill-buffer</span> newBuf<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
