posts/elisp.org
*** with-temp-file
with-temp-file → (with-temp-file FILE BODY).

Create a new buffer, make it current, evaluate BODY, and write the buffer to FILE. The value returned is the value of the last form in BODY.
#+BEGIN_SRC emacs-lisp
;; create a file with text hello

(with-temp-file "test.txt"
  (insert "hello"))
#+END_SRC
* File/Dir Path
*** Function on File
- set-files-modes
- file-exists-p
#+BEGIN_SRC emacs-lisp
(rename-file "/home/joe/test1.txt" "/home/joe/test2.txt")

(copy-file "/home/joe/test1.txt" "/home/joe/test2.txt")

(delete-file "/home/joe/test2.txt")
#+END_SRC
*** Functions on Directory
- firectory-files
- make-directory
- delete-directory
- copy-directory
#+BEGIN_SRC emacs-lisp
(defun make-backup ()
  "Make a backup copy of current buffer's file.
Create a backup of current buffer's file.
The new file name is the old file name with trailing “~”, in the same dir.
If such a file already exist, append more “~”.
If the current buffer is not associated with a file, its a error."
  (interactive)
  (let ((fName (buffer-file-name))
         backupName )
    (if (not fname)
        (error "current buffer is not a file." )
      (progn
        (setq backupName (concat fName "~"))
        (while (file-exists-p backupName)
          (setq backupName (concat backupName "~")))
        (copy-file fName backupName t)
        (message (concat "Backup saved as: " (file-name-nondirectory backupName)))))))
#+END_SRC
*** File Path Functions
#+BEGIN_SRC emacs-lisp
;; get the dir path part

(file-name-directory "/home/joe/xyz.txt") ; "/home/joe/"

;; get filename part
(file-name-nondirectory "/home/joe/xyz.txt") ; "xyz.txt"

;; get filename's extension
(file-name-extension "/home/joe/cat.txt.jpg") ; "jpg"

;; get filename without extension
(file-name-sans-extension "/home/joe/cat.txt.jpg") ; "/home/joe/cat.txt"

;; get relative path
(file-relative-name "/home/joe/b/cat.jpg" "/home/joe/") ; "b/cat.jpg"

;; get full path
(expand-file-name "test.el")
;; sample output
;; "/home/joe/misc/emacs/test.el"
#+END_SRC
