posts/elisp.html
<div id="outline-container-org7d5e826" class="outline-4">
<h4 id="org7d5e826"><span class="section-number-4">3.5.6</span> with-temp-file</h4>
<div class="outline-text-4" id="text-3-5-6">
<p>
with-temp-file → (with-temp-file FILE BODY).
</p>

<p>
Create a new buffer, make it current, evaluate BODY, and write the buffer to FILE. The value returned is the value of the last form in BODY.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">create a file with text hello</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">with-temp-file</span> <span style="color: #99bb66;">"test.txt"</span>
  <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">insert</span> <span style="color: #99bb66;">"hello"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf834c0" class="outline-2">
<h2 id="orgdf834c0"><span class="section-number-2">4</span> File/Dir Path</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc487c0b" class="outline-4">
<h4 id="orgc487c0b"><span class="section-number-4">4.0.1</span> Function on File</h4>
<div class="outline-text-4" id="text-4-0-1">
<ul class="org-ul">
<li>set-files-modes</li>
<li>file-exists-p</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #a9a1e1;">rename-file</span> <span style="color: #99bb66;">"/home/joe/test1.txt"</span> <span style="color: #99bb66;">"/home/joe/test2.txt"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">copy-file</span> <span style="color: #99bb66;">"/home/joe/test1.txt"</span> <span style="color: #99bb66;">"/home/joe/test2.txt"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">delete-file</span> <span style="color: #99bb66;">"/home/joe/test2.txt"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6b74a86" class="outline-4">
<h4 id="org6b74a86"><span class="section-number-4">4.0.2</span> Functions on Directory</h4>
<div class="outline-text-4" id="text-4-0-2">
<ul class="org-ul">
<li>firectory-files</li>
<li>make-directory</li>
<li>delete-directory</li>
<li>copy-directory</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">make-backup</span> <span style="color: #c678dd;">()</span>
  <span style="color: #7d7d7d;">"Make a backup copy of current buffer's file.</span>
<span style="color: #7d7d7d;">Create a backup of current buffer's file.</span>
<span style="color: #7d7d7d;">The new file name is the old file name with trailing &#8220;~&#8221;, in the same dir.</span>
<span style="color: #7d7d7d;">If such a file already exist, append more &#8220;~&#8221;.</span>
<span style="color: #7d7d7d;">If the current buffer is not associated with a file, its a error."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">interactive</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #99bb66;">(</span><span style="color: #51afef;">(</span>fName <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">buffer-file-name</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
         backupName <span style="color: #99bb66;">)</span>
    <span style="color: #99bb66;">(</span><span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">not</span> fname<span style="color: #51afef;">)</span>
        <span style="color: #51afef;">(</span><span style="color: #c678dd;">error</span> <span style="color: #99bb66;">"current buffer is not a file."</span> <span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">progn</span>
        <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> backupName <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">concat</span> fName <span style="color: #99bb66;">"~"</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #51afef;">while</span> <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">file-exists-p</span> backupName<span style="color: #99bb66;">)</span>
          <span style="color: #99bb66;">(</span><span style="color: #51afef;">setq</span> backupName <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">concat</span> backupName <span style="color: #99bb66;">"~"</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">copy-file</span> fName backupName t<span style="color: #c678dd;">)</span>
        <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">message</span> <span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #99bb66;">"Backup saved as: "</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-name-nondirectory</span> backupName<span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge39536b" class="outline-4">
<h4 id="orge39536b"><span class="section-number-4">4.0.3</span> File Path Functions</h4>
<div class="outline-text-4" id="text-4-0-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #525252;">;; </span><span style="color: #525252;">get the dir path part</span>

<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-name-directory</span> <span style="color: #99bb66;">"/home/joe/xyz.txt"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">"/home/joe/"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename part</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">file-name-nondirectory</span> <span style="color: #99bb66;">"/home/joe/xyz.txt"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">"xyz.txt"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename's extension</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-extension</span> <span style="color: #99bb66;">"/home/joe/cat.txt.jpg"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">"jpg"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get filename without extension</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">file-name-sans-extension</span> <span style="color: #99bb66;">"/home/joe/cat.txt.jpg"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">"/home/joe/cat.txt"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get relative path</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">file-relative-name</span> <span style="color: #99bb66;">"/home/joe/b/cat.jpg"</span> <span style="color: #99bb66;">"/home/joe/"</span><span style="color: #51afef;">)</span> <span style="color: #525252;">; </span><span style="color: #525252;">"b/cat.jpg"</span>

<span style="color: #525252;">;; </span><span style="color: #525252;">get full path</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">expand-file-name</span> <span style="color: #99bb66;">"test.el"</span><span style="color: #51afef;">)</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">sample output</span>
<span style="color: #525252;">;; </span><span style="color: #525252;">"/home/joe/misc/emacs/test.el"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: AkashRaj</p>
<p class="date">Created: 2021-07-21 Wed 23:03</p>
</div>
</body>
</html>
